%%%-------------------------------------------------------------------
%%% @author Ashen
%%% @copyright (C) 2017, <COMPANY>
%%% @doc
%%%         快速排序
%%%         1）选择一个基准元素,通常选择第一个元素或者最后一个元素,
%%%         2）通过一趟排序讲待排序的记录分割成独立的两部分，其中一部分记录的元素值均比基准元素值小。另一部分记录的 元素值比基准值大。
%%%         3）此时基准元素在其排好序后的正确位置
%%%         4）然后分别对这两部分记录用同样的方法继续进行排序，直到整个序列有序。
%%% @end
%%% Created : 27. 十月 2017 15:41
%%%-------------------------------------------------------------------
-module(quick_sort).
-author("Ashen").

%% API
-export([
    sort/0,
    sort/1
]).

sort() ->
    sort(sort_util:init_rand_list()).

sort([]) ->
    [];
sort([H | T]) ->
    sort([X || X <- T, X < H]) ++ [H] ++ sort([X || X <- T, X >= H]).
